{
   "allow_add_mods" : true,
   "custom_icons" : false,
   "dependencies" : [
      {
         "fileId" : 2504530003,
         "localId" : "40639a2c-bb9f-4d4f-b88c-41bfe264ffa8"
      }
   ],
   "description" : "[b]WARNING FOR ANYONE WHO USES 00FANT'S TOOLS MOD:\r\n\r\nIt resets speed constantly so it doesn't work with this mod. I cannot fix this, Fant has to fix it and it will be hard to convince him otherwise. If you experience problems, try disabling his mod and look for alternatives, such as this mod and Ben Bingo's Block and Part Editor.[/b]\r\n\r\n[i]Previous patch notes in the changelog tab at the top, beside comments.[/i]\r\n\r\n[b]Preservative Update:[/b] [i](Dec 23d, 2024, 1.4)[/i]\r\nSpeed is now preserved when toggling fly mode.\r\nShakes now share one common script - Internal change, doesn't affect normal game.\r\nDiving - Up/Down speed is now affected by the speed shakes. Particles do now appear, but they will be gone in a different way later.\r\nPreserved fly and speed - Fly mode and speed factor are both now preserved when leaving and rejoining a world.\r\nUpdated alert text to make more sense - Before, going from Turbo to Speed said you gained speed, when that wasn't true. See the updated alert text here:\r\n\r\nIncrease speed:\r\n\"fly\" : \"Your inner woc defies gravity...\"\r\n\"speed\" : \"The SpeedShake™ charges up the inner Woc inside you...\",\r\n\"slow\" : \"The SlowShake™ charges your up your inner woc, but it still isn't strong...\",\r\n\"turbo\" : \"The TurboShake™ charges up your inner Woc to extreme levels...\",\r\n\r\nDecrease speed:\r\n\"fly\" : \"Your inner woc obeys Newton...\",\r\n\"speed\" : \"The SpeedShake™ calms your inner woc down, but not fully...\",\r\n\"slow\" : \"The SlowShake™ discharges your inner Woc beyond comprehension...\",\r\n\"turbo\" : \"The TurboShake™ dampens your inner woc, but it is still highly active...\",\r\n\r\nOther:\r\n\"reset\" : \"The ResetShake™ returns your inner Woc to normal levels...\"\r\n\"blank\" : \"Nothing happens....\" (this is when you use a shake twice in a row)\r\n\r\nThese messages can be modified by going to the mod's folder and going into Scripts/messages.json and changing the text. Fly mode text is hard coded though.\r\n\r\n[hr][/hr] \r\n\r\n[h1]Super Sunshakes! Of all colors! Speed up, slow down, and FLY![/h1]\r\n\r\nHow to use:\r\nPut the shakes in your hotbar. Click while holding to drink. Hold F to place down part. You can use the shake and it will apply effects as well.\r\n\r\nFlyShake - Toggle fly mode.\r\nSpeedShake - Speed up to 4x normal speed.\r\nSlowShake - Slow down to half speed.\r\nResetShake - Return speed back to normal.\r\nTurboShake - Supercharge speed to 10x normal.\r\n\r\n[i]Note: When toggling fly mode, your speed effects reset.[/i]\r\n\r\n\r\n\r\nThere are also a few commands you can use instead:\r\n[b]/fly[/b] - Toggles fly mode.\r\n[b]/speed[/b] (multipier) - Sets your speed multiplier to the inputted number. Decimals do work. 1 for default, 2 for double, 3 triple, etc. Setting it negative reverses your movement!\r\n[b]/shakeAlertText[/b] (true/false) - Toggles the text that appears on the top of your screen when using shakes or commands. Saves between worlds.",
   "fileId" : 2865678708,
   "localId" : "e18c61d3-befb-44e5-bbae-d57bfec0f7f5",
   "name" : "Super SunShakes™ Fly Mod",
   "type" : "Blocks and Parts",
   "version" : 1
}
