{
   "allow_add_mods" : true,
   "custom_icons" : false,
   "dependencies" : [
      {
         "fileId" : 2504530003,
         "localId" : "40639a2c-bb9f-4d4f-b88c-41bfe264ffa8"
      }
   ],
   "description" : "[b]WARNING FOR ANYONE WHO USES 00FANT'S TOOLS MOD:\r\n\r\nHis \"Advanced\" Tools mod will constantly reset player speed multiplier, so speed effects in this mod won't work. I cannot fix this myself, and after asking 00Fant to change this, he said nothing, blocked me, and banned me from his discord for seemingly no reason. (Other than I pointed out a flaw in his mod, and he is too narcissistic to fix it, and says its someone else's fault.) Try disabling his mod and look for alternatives, such as this mod and Ben Bingo's Block and Part Editor. I do plan to introduce all of the missing tools from his mod into this one, such as a cosmic SunShake™ as a gravity gun, and a paint bucket SunShake™, to paint whole creations or bodies.[/b]\r\n\r\n[i]Previous patch notes in the changelog tab at the top, beside comments.[/i]\r\n\r\n[b]2.0 Update:[/b] [i](Jun 1st, 2025, 2.0)[/i]\r\nAdded SilverShake™ - Multitool of the other shakes for those who prefer it, also access mod settings from here\r\nCommands removed - /shakeAlertText, /flightMode have been removed and replaced with options in the settings menu.\r\nToggleable shake animations - In settings, you can disable the shakes from appearing in your hand. Scroll in and out of that item after re-enabling.\r\nUpdated visuals - All shakes now have higher resolution textures, as I recreated them as an SVG.\r\nUpdated interaction text - Interaction text for tools changed, physical part variations also support custom interaction text too now.\r\nFixed various animation-related bugs and issues\r\nChanged alert text for the FlyShake™\r\n\r\n[hr][/hr] \r\n\r\n[h1]Super SunShakes™! Of all colors and kinds! Speed up, slow down, and FLY![/h1]\r\n\r\nDISCLAIMER: Creations Of Greatness Inc, LLC is not responsible for any harm done to the customers, including death. May cause lead poisioning, time dilation, or complete destruction of the 4D space-time continuum. \r\n\r\n[h2]These are all the Super SunShakes™ currently in the mod:[/h2] \r\n\r\n[h3]FlyShake™[/h3]\r\n\r\nWith a sip of this magical energy shake, you will have the powers to FLY!\r\nClick to drink, which ascends your inner woc. Drinking again convinces your inner woc to obey Newton. Effects based upon the flight mode selected in settings. When used while the world's gravity is altered, you may sink or float constantly.\r\n\r\n[img]https://media1.giphy.com/media/v1.Y2lkPTc5MGI3NjExcHp0dDcwZWM4azhuYXgycTE5YnZxajZzb3Z2Ym55N3g2aWs1aGpqbCZlcD12MV9pbnRlcm5hbF9naWZfYnlfaWQmY3Q9Zw/acDNCqcY0OZlLzbYci/giphy.gif[/img]\r\n\r\n\r\n\r\n[h3]SpeedShake™[/h3]\r\n\r\nWith a sip of this magical energy shake, you will accelerate to 4x your normal speed!\r\nClick to drink, which accelerates your inner woc. Use of this beverage without levitation may cause falling through the ground.\r\n\r\n[img]https://media1.giphy.com/media/v1.Y2lkPTc5MGI3NjExOWo5NXZwcmE5c2ViYmpkbXMxc3VtczA3ODlpcDNxazY5Z3RicGIxbSZlcD12MV9pbnRlcm5hbF9naWZfYnlfaWQmY3Q9Zw/qyfL8QKYAGU1nUOvmg/giphy.gif[/img]\r\n\r\n\r\n\r\n[h3]SlowShake™[/h3]\r\n\r\nWith a sip of this magical energy shake, you will decelerate to half of your normal speed!\r\nClick to drink, which decelerates your inner woc. Use of this beverage may result in losing any marathon you join.\r\n\r\n[img]https://media.giphy.com/media/lBwvMMhwM3jU6ATp3s/giphy.gif[/img]\r\n\r\n\r\n\r\n[h3]TurboShake™[/h3]\r\n\r\nWith a sip of this magical energy shake, you will accelerate to 10x your normal speed!\r\nClick to drink, which accelerates your inner woc. Use of this beverage without levitation may cause falling through the ground.\r\n\r\n[img]https://media.giphy.com/media/QOaICyLcXnsMtQH4mH/giphy.gif[/img]\r\n\r\n\r\n\r\n[h3]ResetShake™[/h3]\r\n\r\nWith a sip of this magical energy shake, you will calm your inner woc and return to your normal speed!\r\nClick to drink, which calms your inner woc. Use of this beverage without levitation may cause falling through the ground.\r\n\r\n[img]https://media.giphy.com/media/5ORxXlBhpi8eERc1lp/giphy.gif[/img]\r\n\r\n\r\n\r\n[h3]SilverShake™[/h3]\r\n\r\nThis metallic Super SunShake™ has changing material properties!\r\nUse as a bundle of all the other tools if preferred. Cycle through the different Super SpeedShakes™, which changes the properties of the supermetal it is made of, changing how it affects your body.\r\nAccess mod settings from here. Use of this beverage when it is applying speed effects without levitation may cause falling through the ground, or losing marathons, it depends.\r\n\r\n[img]https://media4.giphy.com/media/v1.Y2lkPTc5MGI3NjExYXVsMXRidG16MWxqN3N6ampvanRqZ293NHh5dndycGY5MWNhZGtuZCZlcD12MV9pbnRlcm5hbF9naWZfYnlfaWQmY3Q9Zw/nUeZ47LQclHbVPpKID/giphy.gif[/img]\r\n\r\n\r\n\r\n[hr][/hr]\r\n\r\nWhen holding your force build key, (usually F) you can place down any Super SunShake™ you want besides SilverShake™. You can then directly drink these physical shakes instead of using a tool. You can also see all the details on the cool new textures this way, such as the ingredients list and QR code.\r\nFun fact: These placeable versions used to be the ONLY way to use the mod. You were required to place one down and then use it. I later changed it in the 1.0 update, which introduced tool variations, although they had no visuals at all and were very primitive.\r\n\r\n[hr][/hr]\r\n\r\n[h3]There are also a few commands you can use instead:[/h3]\r\n\r\n[b]/fly[/b] - Toggles fly mode.\r\n[b]/speed[/b] (multipier) - Sets your speed multiplier to the inputted number. Decimals do work. 1 for default, 2 for double, 3 triple, etc. Setting it negative reverses your movement, setting it to 0 locks you in place.",
   "fileId" : 2865678708,
   "localId" : "e18c61d3-befb-44e5-bbae-d57bfec0f7f5",
   "name" : "Super SunShakes™ Fly Mod",
   "type" : "Blocks and Parts",
   "version" : 1
}
